import { ResidencyType } from "@/lib/types/residency";
import ResidenciesClient from "./_components/residencies-client";
import blog_img from "@/assets/blog_img.jpg";

export default function ResidenciesPage() {
  const residencies: ResidencyType[] = [
    {
      id: 1,
      title: "الإقامة المميزة",
      description:
        "تقدم الإقامة المميزة في السعودية مزايا استثنائية للمستثمرين ورجال الأعمال، بما في ذلك تسهيلات في الإجراءات الحكومية، وإمكانية الحصول على تأشيرات متعددة الدخول، وخدمات دعم متكاملة لتعزيز نجاح المشاريع الاستثمارية.",
      image: blog_img,
    },
    {
      id: 2,
      title: "الإقامة المميزة",
      description:
        "تقدم الإقامة المميزة في السعودية مزايا استثنائية للمستثمرين ورجال الأعمال، بما في ذلك تسهيلات في الإجراءات الحكومية، وإمكانية الحصول على تأشيرات متعددة الدخول، وخدمات دعم متكاملة لتعزيز نجاح المشاريع الاستثمارية.",
      image: blog_img,
    },
    {
      id: 3,
      title: "الإقامة المميزة",
      description:
        "تقدم الإقامة المميزة في السعودية مزايا استثنائية للمستثمرين ورجال الأعمال، بما في ذلك تسهيلات في الإجراءات الحكومية، وإمكانية الحصول على تأشيرات متعددة الدخول، وخدمات دعم متكاملة لتعزيز نجاح المشاريع الاستثمارية.",
      image: blog_img,
    },
    {
      id: 4,
      title: "الإقامة المميزة",
      description:
        "تقدم الإقامة المميزة في السعودية مزايا استثنائية للمستثمرين ورجال الأعمال، بما في ذلك تسهيلات في الإجراءات الحكومية، وإمكانية الحصول على تأشيرات متعددة الدخول، وخدمات دعم متكاملة لتعزيز نجاح المشاريع الاستثمارية.",
      image: blog_img,
    },
    {
      id: 5,
      title: "الإقامة المميزة",
      description:
        "تقدم الإقامة المميزة في السعودية مزايا استثنائية للمستثمرين ورجال الأعمال، بما في ذلك تسهيلات في الإجراءات الحكومية، وإمكانية الحصول على تأشيرات متعددة الدخول، وخدمات دعم متكاملة لتعزيز نجاح المشاريع الاستثمارية.",
      image: blog_img,
    },
    {
      id: 6,
      title: "الإقامة المميزة",
      description:
        "تقدم الإقامة المميزة في السعودية مزايا استثنائية للمستثمرين ورجال الأعمال، بما في ذلك تسهيلات في الإجراءات الحكومية، وإمكانية الحصول على تأشيرات متعددة الدخول، وخدمات دعم متكاملة لتعزيز نجاح المشاريع الاستثمارية.",
      image: blog_img,
    },
  ];

  return <ResidenciesClient residencies={residencies} />;
}
